#+title: Advent of Code '23 - day 16
#+date: <2023-12-16 Sat>

#+begin_preview
Part one involves once again, following a path without getting stuck in an endless loop.  For part two my solution was to simple run the same code over and over again and deduce the answer, but it got rejected.  I have a gut feeling this is due to to loop detection, which kicks in at the wrong moment and thus stopping a trace prematurely.  Will look into this later.
#+end_preview

* Part 2
#+begin_src elisp :var input=input

#+end_src

#+RESULTS:
: max: 8300
